RT-Thread/rt-thread/bsp/apm32/libraries/APM32E10x_Library/APM32E10x_StdPeriphDriver/src/apm32e10x_sci2c.c
/*!
 * @file        apm32e10x_sci2c.c
 *
 * @brief       This file contains all the functions for the SCI2C peripheral
 *
 * @version     V1.0.2
 *
 * @date        2022-12-31
 *
 * @attention
 *
 *  Copyright (C) 2021-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32e10x_sci2c.h"
#include "apm32e10x_rcm.h"

/** @addtogroup APM32E10x_StdPeriphDriver
  @{
*/

/** @addtogroup SCI2C_Driver
  * @brief SCI2C driver modules
  @{
*/

/** @defgroup SCI2C_Functions Functions
  @{
*/

/*!
 * @brief       Set I2C peripheral registers to their default reset values
 *
 * @param       i2c: Select the the I2C peripheral.It can be I2C3 or I2C4
 *
 * @retval      None
 */
void SCI2C_Reset(SCI2C_T *i2c)
{
    if(i2c == I2C3)
    {
        RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_I2C1);
        RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_I2C1);
    }
    else
    {
        RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_I2C2);
        RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_I2C2);
    }

    i2c->SW = 0;
    i2c->SW = 1;
    i2c->INTEN = 0;
}

/*!
 * @brief       Config the I2C peripheral according to the specified parameters in the sci2cConfig
 *
 * @param       i2c: Select the the I2C peripheral.It can be I2C3 or I2C4
 *
 * @param       sci2cConfig: pointer to a SCI2C_Config_T structure
 *
 * @retval      None
 */
void SCI2C_Config(SCI2C_T *i2c, SCI2C_Config_T *sci2cConfig)
{
    i2c->SW = BIT_SET;

    i2c->CTRL2_B.I2CEN = BIT_RESET;

    if(sci2cConfig->mode == SCI2C_MODE_MASTER)
    {
        i2c->CTRL1_B.MST = BIT_SET;
        i2c->CTRL1_B.SLADIS = BIT_SET;
    }
    else
    {
        i2c->CTRL1_B.MST = BIT_RESET;
    }

    i2c->CTRL1_B.SPD = sci2cConfig->speed;
    i2c->CTRL1_B.RSTAEN = sci2cConfig->restart;

    i2c->TFT = sci2cConfig->txFifoThreshold;
    i2c->RFT = sci2cConfig->rxFifoThreshold;

    i2c->TARADDR_B.MAM = sci2cConfig->addrMode;
    i2c->CTRL1_B.SAM = sci2cConfig->addrMode;
    i2c->SLAADDR = sci2cConfig->slaveAddr;

    if(sci2cConfig->speed == SCI2C_SPEED_STANDARD)
    {
        i2c->SSCLC = sci2cConfig->clkLowPeriod;
        i2c->SSCHC = sci2cConfig->clkHighPeriod;
    }
    else if(sci2cConfig->speed == SCI2C_SPEED_FAST)
    {
        i2c->FSCLC = sci2cConfig->clkLowPeriod;
        i2c->FSCHC = sci2cConfig->clkHighPeriod;
    }
    else if(sci2cConfig->speed == SCI2C_SPEED_HIGH)
    {
        i2c->HSCLC = sci2cConfig->clkLowPeriod;
        i2c->HSCHC = sci2cConfig->clkHighPeriod;
    }
}

/*!
 * @brief       Fills each sci2cConfig member with its default value
 *
 * @param       sci2cConfig: pointer to a SCI2C_Config_T structure
 *
 * @retval      None
 */
void SCI2C_ConfigStructInit(SCI2C_Config_T *sci2cConfig)
{
    sci2cConfig->addrMode = SCI2C_ADDR_MODE_7BIT;
    sci2cConfig->slaveAddr = 0x55;
    sci2cConfig->clkHighPeriod = 0x3C;
    sci2cConfig->clkLowPeriod = 0x82;
    sci2cConfig->mode = SCI2C_MODE_MASTER;
    sci2cConfig->restart = SCI2C_RESTART_ENABLE;
    sci2cConfig->rxFifoThreshold = 0;
    sci2cConfig->txFifoThreshold = 0;
    sci2cConfig->speed = SCI2C_SPEED_FAST;
}

/*!
 * @brief       Read specified flag
 *
 * @param       i2c:    Select the the I2C peripheral.It can be I2C3 or I2C4
 *
 * @param       flag:   Specifies the flag to be checked
 *                      The parameter can be one of following values:
 *                      @arg SCI2C_FLAG_ACT:    Activity flag
 *                      @arg SCI2C_FLAG_TFNF:   Tx FIFO not full flag
 *                      @arg SCI2C_FLAG_TFE:    TX FIFO empty flag
 *                      @arg SCI2C_FLAG_RFNE:   Rx FIFO not empty flag
 *                      @arg SCI2C_FLAG_RFF:    Rx FIFO full flag
 *                      @arg SCI2C_FLAG_MA:     Master activity flag
 *                      @arg SCI2C_FLAG_SA:     Slave activity flag
 *                      @arg SCI2C_FLAG_I2CEN:  I2C enable flag
 *                      @arg SCI2C_FLAG_SDWB:   Slave disable while busy flag
 *                      @arg SCI2C_FLAG_SRDL:   Slave receive data lost flag
 *
 * @retval      The new state of flag (SET or RESET)
 */
uint8_t SCI2C_ReadStatusFlag(SCI2C_T *i2c, SCI2C_FLAG_T flag)
{
    uint8_t ret = RESET;

    if(flag & BIT8)
    {
        ret = i2c->STS2 & flag ? SET : RESET;
    }
    else
    {
        ret = i2c->STS1 & flag ? SET : RESET;
    }

    return ret;
}

/*!
 * @brief       Read specified interrupt flag
 *
 * @param       i2c:    Select the the I2C peripheral.It can be I2C3 or I2C4
 *
 * @param       flag:   Specifies the interrupt flag to be checked
 *                      The parameter can be one of following values:
 *                      @arg SCI2C_INT_RFU:    Rx FIFO underflow interrupt flag
 *                      @arg SCI2C_INT_RFO:    Rx FIFO onverflow interrupt flag
 *                      @arg SCI2C_INT_RFF:    Rx FIFO full interrupt flag
 *                      @arg SCI2C_INT_TFO:    Tx FIFO onverflow interrupt flag
 *                      @arg SCI2C_INT_TFE:    Tx FIFO empty interrupt flag
 *                      @arg SCI2C_INT_RR:     Read request interrupt flag
 *                      @arg SCI2C_INT_TA:     Tx abort interrupt flag
 *                      @arg SCI2C_INT_RD:     Read done interrupt flag
 *                      @arg SCI2C_INT_ACT:    Activity interrupt flag
 *                      @arg SCI2C_INT_STPD:   Stop detect interrupt flag
 *                      @arg SCI2C_INT_STAD:   Start detect interrupt flag
 *                      @arg SCI2C_INT_GC:     Gernal call interrupt flag
 *                      @arg SCI2C_INT_RSTAD:  Restart detect interrupt flag
 *                      @arg SCI2C_INT_MOH:    Master on hold interrupt flag
 *
 * @retval      The new state of flag (SET or RESET)
 */
uint8_t SCI2C_ReadIntFlag(SCI2C_T *i2c, SCI2C_INT_T flag)
{
    uint8_t ret = RESET;

    ret = i2c->INTSTS & flag ? SET : RESET;

    return ret;
}

/*!
 * @brief       Clear specified interrupt flag
 *
 * @param       i2c:    Select the the I2C peripheral.It can be I2C3 or I2C4
 *
 * @param       flag:   Specifies the interrupt flag to be checked
 *                      The parameter can be one of following values:
 *                      @arg SCI2C_INT_RFU:    Rx FIFO underflow interrupt flag
 *                      @arg SCI2C_INT_RFO:    Rx FIFO onverflow interrupt flag
 *                      @arg SCI2C_INT_TFO:    Tx FIFO onverflow interrupt flag
 *                      @arg SCI2C_INT_RR:     Read request interrupt flag
 *                      @arg SCI2C_INT_TA:     Tx abort interrupt flag
 *                      @arg SCI2C_INT_RD:     Read done interrupt flag
 *                      @arg SCI2C_INT_ACT:    Activity interrupt flag
 *                      @arg SCI2C_INT_STPD:   Stop detect interrupt flag
 *                      @arg SCI2C_INT_STAD:   Start detect interrupt flag
 *                      @arg SCI2C_INT_GC:     Gernal call interrupt flag
 *                      @arg SCI2C_INT_ALL:    All interrupt flag
 * @retval      The new state of flag (SET or RESET)
 */
void SCI2C_ClearIntFlag(SCI2C_T *i2c, SCI2C_INT_T flag)
{
    volatile uint32_t dummy = 0;

